DataProcessors/ПеремещениеТовараИзЯчейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПеремещениеТовараИзЯчейки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОткудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеИзЯчейкиМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПеремещениеТовараИзЯчейки/Forms/ФормаВыбораЯчейкиКуда/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыПриПеремещении();
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);
 		
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЯчейку(Команда)
	
	ЗапроситьЯчейкуСсервера(Объект.ЯчейкаКуда);	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗапроситьЯчейкуСсервера(Текст)
	

	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Текст);                     
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		ТекстОшибки = "Ячейка " + Текст + " некорректна !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		Объект.ЯчейкаКудаГУИД = "";		
		Объект.ЯчейкаКуда = "";
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат.Данные) И Объект.ЯчейкаОткуда = Текст Тогда

		ПоказатьПредупреждение(, "Ячейки откуда " + Объект.ЯчейкаОткуда 
					+ " и куда " + Текст + " должны быть разными", 4);
					
		Объект.ЯчейкаКудаГУИД = "";		
		Объект.ЯчейкаКуда = "";
					
		Возврат;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда
				
		Объект.ЯчейкаКудаГУИД = Результат.Данные;						
		Объект.ЯчейкаКуда = Текст;
		
		ПараметрыРаботы = ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПеремещениеТовараИзЯчейки", Объект);
		ОбщегоНазначения.ЗаписатьПараметрыРаботы( "ПараметрыРаботыПриПеремещении", ПараметрыРаботы );			
		
		Закрыть();
		ОткрытьФорму("Обработка.ПеремещениеТовараИзЯчейки.Форма.ФормаВыбораНоменклатуры");
					
	КонецЕсли; 
		
КонецПроцедуры                                                                                       

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
		
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		Если ВводДоступен() Тогда
			ЗапроситьЯчейкуСсервера(Результат.Штрихкод);	
		КонецЕсли; 
		
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		ЗапроситьЯчейкуСсервера(Данные);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;
		
КонецПроцедуры
